# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Next, import `Orders` from Ironhack's database into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here
df='Orders.csv'
df= pd.read_csv(df)

In [3]:
df.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [4]:
df.duplicated().any()

False

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [5]:
# your code here

In [6]:
df_agrupado=df.groupby('CustomerID').sum()
df_agrupado.sort_values('amount_spent',ascending=False)

C:\Users\Lidiavf1912\AppData\Local\Temp\ipykernel_11040\4170258461.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_agrupado=df.groupby('CustomerID').sum()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
14646,544561120,1163267611,4182810,14191,6552,24488,197491,5176.09,280206.02
18102,138022684,243297801,866723,3746,1261,5587,64124,1940.92,259657.30
17450,92683919,188845149,677704,2292,842,4140,69993,1143.32,194550.79
16446,929130,1688629,6033,22,11,27,80997,4.98,168472.50
14911,1737367680,3196374868,11416155,46220,18930,68148,80515,26185.72,143825.06
...,...,...,...,...,...,...,...,...,...
17956,144967,548862,2011,4,1,13,1,12.75,12.75
16454,802063,1142747,4022,20,7,27,3,3.95,6.90
14792,766395,1140006,4022,20,10,18,2,6.20,6.20
16738,90155,543986,2011,2,2,9,3,1.25,3.75
13256,502122,578841,2011,11,5,15,12540,0.00,0.00

In [7]:
minimo = df_agrupado['amount_spent'].min()
minimo

0.0

In [8]:
maximo= df_agrupado['amount_spent'].max()
maximo

280206.02

In [9]:
per_95 = np.percentile(df_agrupado['amount_spent'], 95)
per_95

5840.181999999982

In [10]:
per_75 = np.percentile(df_agrupado['amount_spent'], 75)
per_75

1661.64

In [11]:
vip=df_agrupado[df_agrupado.amount_spent>=per_95]
vip.sort_values('amount_spent', ascending=False)

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
14646,544561120,1163267611,4182810,14191,6552,24488,197491,5176.09,280206.02
18102,138022684,243297801,866723,3746,1261,5587,64124,1940.92,259657.30
17450,92683919,188845149,677704,2292,842,4140,69993,1143.32,194550.79
16446,929130,1688629,6033,22,11,27,80997,4.98,168472.50
14911,1737367680,3196374868,11416155,46220,18930,68148,80515,26185.72,143825.06
...,...,...,...,...,...,...,...,...,...
14505,203796653,446233131,1606652,6574,2471,11584,2759,2307.71,5905.64
14415,163006809,330504645,1186402,4923,2093,8339,3011,1741.07,5900.28
14944,45316103,95192895,341870,1174,499,1945,2815,511.14,5900.25
13209,85155019,179608591,645518,2266,745,3635,4253,728.00,5891.61
13534,68916671,164792347,595245,1822,904,3373,2961,832.06,5870.08

In [12]:
preferred=df_agrupado[(df_agrupado.amount_spent<per_95)&(df_agrupado.amount_spent>=per_75)]
preferred.sort_values('amount_spent', ascending=False)

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
13050,88073344,223872574,810364,2992,1278,4940,3748,1204.52,5836.86
12720,90950303,197785584,711849,2760,1106,4153,4672,956.36,5781.73
15218,41221248,92641005,333826,1009,302,1823,3329,513.44,5756.89
17686,72758466,159766169,575146,1824,905,3433,2478,1103.64,5739.46
13178,59276272,147365548,532883,1858,872,3321,3570,542.34,5725.47
...,...,...,...,...,...,...,...,...,...
17656,26948585,46383537,164902,694,221,1018,1399,227.35,1674.69
16115,79647663,159284285,571124,1941,1580,3568,1001,669.36,1667.97
12912,11649212,13864381,48264,268,117,280,670,65.26,1662.30
12530,16317074,36836875,132726,421,166,686,913,256.44,1662.28
13012,25927145,49981037,178979,626,333,1056,824,287.64,1661.84

In [13]:
def clase(amount, corte95, corte75):
    if amount>=corte95:
        return 'vip'
    elif amount<corte95 and amount>=corte75:
        return 'preferred'
    else:
        return "morralla"

In [14]:
df_agrupado['type']= df_agrupado["amount_spent"].apply(lambda x:clase(x,per_95,per_75))
df_agrupado

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent,type
CustomerID,,,,,,,,,,
12346,61619,541431,2011,1,2,10,74215,1.04,77183.60,vip
12347,42441700,101296926,365971,1383,441,2219,2458,481.21,4310.00,preferred
12348,2807120,16869685,62324,257,111,472,2341,178.71,1797.24,preferred
12349,35444274,42165457,146803,803,73,657,631,605.10,1757.55,preferred
12350,1365627,9231629,34187,34,51,272,197,65.30,334.40,morralla
...,...,...,...,...,...,...,...,...,...,...
18280,1110495,5457120,20110,30,10,90,45,47.65,180.60,morralla
18281,1560699,3895248,14077,42,49,70,54,39.36,80.82,morralla
18282,4642134,6838540,24132,116,60,146,103,62.39,178.05,morralla
18283,233950830,425704048,1520316,5503,2489,10346,1397,1220.93,2094.88,preferred
18287,21958901,39474556,140770,555,332,697,1586,104.55,1837.28,preferred

In [15]:
df_agrupado.type.value_counts()

morralla     3254
preferred     868
vip           217
Name: type, dtype: int64

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [16]:
df_pais=df.groupby(['Country','CustomerID']).sum()
df_pais.head()

C:\Users\Lidiavf1912\AppData\Local\Temp\ipykernel_11040\2709717861.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_pais=df.groupby(['Country','CustomerID']).sum()

                      Unnamed: 0  InvoiceNo     year  month   day  hour  \
Country   CustomerID
Australia 12386           228213    5381968    20102     98    32    96
          12388         23878866   55733658   201100    592   381  1230
          12393         12849375   35452768   128704    315   213   732
          12415        164201777  398543981  1439876   4254  2169  8061
          12422          3428310   11563488    42231     85    47   189

                      Quantity  UnitPrice  amount_spent
Country   CustomerID
Australia 12386            354      23.91        401.90
          12388           1462     277.77       2780.66
          12393            816     145.90       1582.60
          12415          77670    2097.08     124914.53
          12422            195      51.12        386.20

In [17]:
df_pais['type']= df_pais["amount_spent"].apply(lambda x:clase(x,per_95,per_75))
df_pais.head()

                      Unnamed: 0  InvoiceNo     year  month   day  hour  \
Country   CustomerID
Australia 12386           228213    5381968    20102     98    32    96
          12388         23878866   55733658   201100    592   381  1230
          12393         12849375   35452768   128704    315   213   732
          12415        164201777  398543981  1439876   4254  2169  8061
          12422          3428310   11563488    42231     85    47   189

                      Quantity  UnitPrice  amount_spent       type
Country   CustomerID
Australia 12386            354      23.91        401.90   morralla
          12388           1462     277.77       2780.66  preferred
          12393            816     145.90       1582.60   morralla
          12415          77670    2097.08     124914.53        vip
          12422            195      51.12        386.20   morralla

In [43]:
df_final1 = df_pais.copy()
df_final1 = df_final1.reset_index()
df_final_vip = df_final1[df_final1["type"]== "vip"]
df_final_vip= df_final_vip.groupby("Country")["CustomerID"].count().sort_values(ascending=False)
df_final_vip

Country
United Kingdom     177
Germany             10
France               9
Switzerland          3
Spain                2
Portugal             2
Japan                2
EIRE                 2
Finland              1
Channel Islands      1
Netherlands          1
Norway               1
Singapore            1
Denmark              1
Sweden               1
Cyprus               1
Australia            1
Name: CustomerID, dtype: int64

In [44]:
df_final_preferred = df_final1[df_final1["type"]== "preferred"]
df_final_preferred=df_final_preferred.groupby("Country")["CustomerID"].count().sort_values(ascending=False)
df_final_preferred

Country
United Kingdom     755
Germany             29
France              20
Belgium             11
Switzerland          6
Norway               6
Spain                5
Portugal             5
Italy                5
Finland              4
Australia            3
Channel Islands      3
Israel               2
Japan                2
Denmark              2
Cyprus               2
Greece               1
Austria              1
EIRE                 1
Lebanon              1
Malta                1
Poland               1
Sweden               1
Canada               1
Iceland              1
Name: CustomerID, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [19]:
# your code here

In [39]:
df_superfinal=df_final_preferred+df_final_vip

In [41]:
df_superfinal.sort_values(ascending=False)

Country
United Kingdom     932.0
Germany             39.0
France              29.0
Switzerland          9.0
Norway               7.0
Portugal             7.0
Spain                7.0
Finland              5.0
Australia            4.0
Channel Islands      4.0
Japan                4.0
Cyprus               3.0
Denmark              3.0
EIRE                 3.0
Sweden               2.0
Austria              NaN
Belgium              NaN
Canada               NaN
Greece               NaN
Iceland              NaN
Israel               NaN
Italy                NaN
Lebanon              NaN
Malta                NaN
Netherlands          NaN
Poland               NaN
Singapore            NaN
Name: CustomerID, dtype: float64